Model: "model_50"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_401 (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_402 (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_403 (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_404 (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_405 (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_406 (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_407 (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
embedding_350 (Embedding)       (None, 1, 9)         207         input_401[0][0]                  
__________________________________________________________________________________________________
embedding_351 (Embedding)       (None, 1, 1)         2           input_402[0][0]                  
__________________________________________________________________________________________________
embedding_352 (Embedding)       (None, 1, 6)         72          input_403[0][0]                  
__________________________________________________________________________________________________
embedding_353 (Embedding)       (None, 1, 11)        341         input_404[0][0]                  
__________________________________________________________________________________________________
embedding_354 (Embedding)       (None, 1, 15)        795         input_405[0][0]                  
__________________________________________________________________________________________________
embedding_355 (Embedding)       (None, 1, 5)         35          input_406[0][0]                  
__________________________________________________________________________________________________
embedding_356 (Embedding)       (None, 1, 2)         4           input_407[0][0]                  
__________________________________________________________________________________________________
input_408 (InputLayer)          [(None, 11)]         0                                            
__________________________________________________________________________________________________
reshape_350 (Reshape)           (None, 9)            0           embedding_350[0][0]              
__________________________________________________________________________________________________
reshape_351 (Reshape)           (None, 1)            0           embedding_351[0][0]              
__________________________________________________________________________________________________
reshape_352 (Reshape)           (None, 6)            0           embedding_352[0][0]              
__________________________________________________________________________________________________
reshape_353 (Reshape)           (None, 11)           0           embedding_353[0][0]              
__________________________________________________________________________________________________
reshape_354 (Reshape)           (None, 15)           0           embedding_354[0][0]              
__________________________________________________________________________________________________
reshape_355 (Reshape)           (None, 5)            0           embedding_355[0][0]              
__________________________________________________________________________________________________
reshape_356 (Reshape)           (None, 2)            0           embedding_356[0][0]              
__________________________________________________________________________________________________
dense_250 (Dense)               (None, 9)            108         input_408[0][0]                  
__________________________________________________________________________________________________
concatenate_50 (Concatenate)    (None, 58)           0           reshape_350[0][0]                
                                                                 reshape_351[0][0]                
                                                                 reshape_352[0][0]                
                                                                 reshape_353[0][0]                
                                                                 reshape_354[0][0]                
                                                                 reshape_355[0][0]                
                                                                 reshape_356[0][0]                
                                                                 dense_250[0][0]                  
__________________________________________________________________________________________________
dense_251 (Dense)               (None, 80)           4720        concatenate_50[0][0]             
__________________________________________________________________________________________________
dropout_150 (Dropout)           (None, 80)           0           dense_251[0][0]                  
__________________________________________________________________________________________________
dense_252 (Dense)               (None, 40)           3240        dropout_150[0][0]                
__________________________________________________________________________________________________
dropout_151 (Dropout)           (None, 40)           0           dense_252[0][0]                  
__________________________________________________________________________________________________
dense_253 (Dense)               (None, 10)           410         dropout_151[0][0]                
__________________________________________________________________________________________________
dropout_152 (Dropout)           (None, 10)           0           dense_253[0][0]                  
__________________________________________________________________________________________________
dense_254 (Dense)               (None, 7)            77          dropout_152[0][0]                
==================================================================================================
Total params: 10,011
Trainable params: 10,011
Non-trainable params: 0
__________________________________________________________________________________________________
