Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_59 (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_60 (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_61 (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_62 (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_63 (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_64 (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
input_65 (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
embedding_42 (Embedding)        (None, 1, 9)         207         input_59[0][0]                   
__________________________________________________________________________________________________
embedding_43 (Embedding)        (None, 1, 1)         2           input_60[0][0]                   
__________________________________________________________________________________________________
embedding_44 (Embedding)        (None, 1, 6)         72          input_61[0][0]                   
__________________________________________________________________________________________________
embedding_45 (Embedding)        (None, 1, 11)        341         input_62[0][0]                   
__________________________________________________________________________________________________
embedding_46 (Embedding)        (None, 1, 15)        795         input_63[0][0]                   
__________________________________________________________________________________________________
embedding_47 (Embedding)        (None, 1, 5)         35          input_64[0][0]                   
__________________________________________________________________________________________________
embedding_48 (Embedding)        (None, 1, 2)         4           input_65[0][0]                   
__________________________________________________________________________________________________
input_66 (InputLayer)           [(None, 4)]          0                                            
__________________________________________________________________________________________________
reshape_49 (Reshape)            (None, 9)            0           embedding_42[0][0]               
__________________________________________________________________________________________________
reshape_50 (Reshape)            (None, 1)            0           embedding_43[0][0]               
__________________________________________________________________________________________________
reshape_51 (Reshape)            (None, 6)            0           embedding_44[0][0]               
__________________________________________________________________________________________________
reshape_52 (Reshape)            (None, 11)           0           embedding_45[0][0]               
__________________________________________________________________________________________________
reshape_53 (Reshape)            (None, 15)           0           embedding_46[0][0]               
__________________________________________________________________________________________________
reshape_54 (Reshape)            (None, 5)            0           embedding_47[0][0]               
__________________________________________________________________________________________________
reshape_55 (Reshape)            (None, 2)            0           embedding_48[0][0]               
__________________________________________________________________________________________________
dense_52 (Dense)                (None, 4)            20          input_66[0][0]                   
__________________________________________________________________________________________________
concatenate_14 (Concatenate)    (None, 53)           0           reshape_49[0][0]                 
                                                                 reshape_50[0][0]                 
                                                                 reshape_51[0][0]                 
                                                                 reshape_52[0][0]                 
                                                                 reshape_53[0][0]                 
                                                                 reshape_54[0][0]                 
                                                                 reshape_55[0][0]                 
                                                                 dense_52[0][0]                   
__________________________________________________________________________________________________
dense_53 (Dense)                (None, 90)           4860        concatenate_14[0][0]             
__________________________________________________________________________________________________
input_67 (InputLayer)           [(None, 14, 8)]      0                                            
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 90)           0           dense_53[0][0]                   
__________________________________________________________________________________________________
lstm_18 (LSTM)                  (None, 14, 32)       5248        input_67[0][0]                   
__________________________________________________________________________________________________
dense_54 (Dense)                (None, 40)           3640        dropout_18[0][0]                 
__________________________________________________________________________________________________
lstm_19 (LSTM)                  (None, 14, 64)       24832       lstm_18[0][0]                    
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 40)           0           dense_54[0][0]                   
__________________________________________________________________________________________________
time_distributed_18 (TimeDistri (None, 14, 16)       1040        lstm_19[0][0]                    
__________________________________________________________________________________________________
dense_55 (Dense)                (None, 14)           574         dropout_19[0][0]                 
__________________________________________________________________________________________________
time_distributed_19 (TimeDistri (None, 14, 1)        17          time_distributed_18[0][0]        
__________________________________________________________________________________________________
dropout_20 (Dropout)            (None, 14)           0           dense_55[0][0]                   
__________________________________________________________________________________________________
reshape_56 (Reshape)            (None, 14)           0           time_distributed_19[0][0]        
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 28)           0           dropout_20[0][0]                 
                                                                 reshape_56[0][0]                 
__________________________________________________________________________________________________
dense_58 (Dense)                (None, 14)           406         concatenate_15[0][0]             
__________________________________________________________________________________________________
dense_59 (Dense)                (None, 7)            105         dense_58[0][0]                   
==================================================================================================
Total params: 42,198
Trainable params: 42,198
Non-trainable params: 0
__________________________________________________________________________________________________
